[{"description":"Build the Railway Exam Prep learning platform homepage. Include: 1) Hero section with tagline 'Crack Railway Exams with Confidence' and brief description about RRB NTPC, Group D, ALP preparation. 2) Exam cards grid showing available exams (RRB NTPC, Group D, ALP, JE) with icons and subject count - fetch from /api/v1/exams. 3) Features section highlighting: Structured Learning, Practice MCQs, Track Progress, Quick Revision Notes. 4) Clean, modern design with blue/indigo color scheme suitable for an educational platform.","type":"feature","passes":true,"id":1},{"description":"Add routing and create Exam Detail Page. When user clicks an exam card, navigate to /exam/:examId page that shows: 1) Exam header with name and description. 2) Breadcrumb navigation (Home > Exam Name). 3) Subject cards grid - fetch subjects from /api/v1/exams/:id - show subject name, chapter count, and progress indicator. 4) Each subject card clickable to go to /subject/:subjectId.","type":"feature","passes":true,"id":2},{"description":"Create Subject Detail Page at /subject/:subjectId. Include: 1) Breadcrumb (Home > Exam > Subject). 2) Subject header with name and exam info. 3) Chapters accordion/list - fetch from /api/v1/subjects/:id showing chapter title, description, lesson count, MCQ count. 4) Each chapter expandable or clickable to navigate to /chapter/:chapterId. 5) Show progress indicators per chapter.","type":"feature","passes":true,"id":3},{"description":"Create Chapter Detail Page at /chapter/:chapterId. Include: 1) Breadcrumb (Home > Exam > Subject > Chapter). 2) Chapter header with title and description. 3) Lessons list - fetch from /api/v1/chapters/:id showing lesson title, duration, difficulty badge (Easy/Medium/Hard with colors), and completion status. 4) Each lesson clickable to /lesson/:lessonId. 5) Sidebar or section showing 'Practice MCQs for this chapter' button with MCQ count. 6) Chapter progress overview.","type":"feature","passes":true,"id":4},{"description":"Create Lesson Detail Page at /lesson/:lessonId. Include: 1) Breadcrumb navigation. 2) Lesson header with title, duration, difficulty. 3) Main content area rendering markdown content with proper styling (headings, lists, tables, code blocks, bold/italic). 4) Sidebar showing 'Important Notes' cards from lesson notes - highlighted notes should have a star icon. 5) Previous/Next lesson navigation buttons at bottom. 6) Mark as Complete button that saves progress.","type":"feature","passes":true,"id":5},{"description":"Create MCQ Practice Page at /chapter/:chapterId/practice route. This is a quiz-style page where users answer multiple choice questions one at a time. Features needed: 1) Header showing chapter name and current progress like 'Question 1 of 10'. 2) Large question card displaying the question text prominently. 3) Four option buttons labeled A, B, C, D - user clicks one to select. 4) After selecting, show a 'Check Answer' button. 5) When checked: if correct show green highlight on selected option, if wrong show red on selected and green on correct answer, plus display the explanation text below. 6) 'Next Question' button appears after checking. 7) After all questions: show results screen with score (e.g. 7/10), accuracy percentage, and buttons to 'Practice Again' or 'Back to Chapter'. Fetch MCQs from /api/v1/chapters/:id/mcqs endpoint.","type":"feature","passes":true,"id":6},{"description":"Update the entire website theme to a clean, minimal design with: 1) White background throughout all pages. 2) Pink as the primary color for buttons, links, accents, and interactive elements. 3) Black as the secondary color for text, headings, and borders. 4) Remove all gradient backgrounds, decorative blobs, and complex patterns. 5) Keep the layout simple and clean with good whitespace. 6) Apply this consistently across homepage, exam page, subject page, chapter page, lesson page, and practice page.","type":"feature","passes":true,"id":7},{"description":"Change the color scheme across all pages to: white background, pink primary color (#EC4899 or similar), black text. Remove gradient backgrounds and decorative elements. Keep it minimal and clean.","type":"feature","passes":true,"id":8},{"description":"Simplify the visual design on all pages. Remove all gradient backgrounds, decorative blur effects, and complex visual patterns. Use plain white backgrounds with simple borders. Keep cards clean with white background and subtle gray borders. The pink color should only appear on buttons, links, and interactive elements. Text should be black. Make it look minimal and professional like a clean documentation site.","type":"feature","passes":true,"id":9},{"description":"Redesign the app to be minimal and direct. Remove the marketing landing page. The homepage should directly show a list of all exams as simple cards (RRB NTPC, Group D, ALP, JE). When clicking an exam, show its subjects. When clicking a subject, show chapters. Remove all fake/random progress indicators - only show actual progress from user data (or no progress bar at all if user not logged in). Keep the pink primary color and white background. Make it feel like a study app, not a marketing website.","type":"feature","passes":true,"id":10}]